// ============================================================================
// 
// クライアント・サーバー共通の定数
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 言語仕様上は変数なので書き換えができてしまうことに注意
// ----------------------------------------------------------------------------

// ====================================================================
// ソケット通信イベント名
// ====================================================================

class socketEvents {
    // 新規グループ作成
    newGroup = "newGroup";

    // 既存グループに参加
    joinGroup = "joinGroup";

    // グループ UUID
    groupUuid = "groupUuid";

    // 参加人数
    numParticipants = "numParticipants";

    // プレイ開始
    startPlay = "startPlay";

    // プレイ開始準備完了
    playReady = "playReady";

    // 参加者情報群
    participantInfos = "participantInfos";

    // 手を出す
    selectTactics = "selectTactics";

    // 勝敗
    judgement = "judgement";

    // エラー発生
    errorMessage = "errorMessage";
}

// ====================================================================
// URL パラメーター
// ====================================================================

class urlParams {
    // グループ UUID
    group = "group";
}

// ====================================================================
// 手
// ====================================================================

class tactics {
    // 思考中
    thinking = 0;

    // グー
    gu = 1;

    // チョキ
    choki = 2;

    // パー
    pa = 3;
}

// ====================================================================
// 勝敗
// ====================================================================

class judgement {
    // 勝ち
    win = 1;

    // 負け
    lose = -1;

    // あいこ
    draw = 0;
}

// ====================================================================
// 全体
// ====================================================================

class csConstants {
    // ソケット通信イベント名
    static socketEvents = new socketEvents();

    // URL パラメーター
    static params = new urlParams();

    // 手
    static tactics = new tactics();

    // 勝敗
    static judgement = new judgement();
}

try {
    // サーバー用にエクスポート（1 つの時は module.exports が便利）
    // クライアントは HTML から読み込む
    module.exports = csConstants;
} catch (e) {
}
