// ============================================================================
// 
// クライアント・サーバー共通のクラス
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 
// ----------------------------------------------------------------------------

// ====================================================================
// 参加者 1 人分の情報
// t_member のうち、サーバーからクライアントに公開する項目
// クライアントは JSON から無名クラスに復元しても問題ないかもしれない（このクラスはサーバー専用でもいいかもしれない）
// ====================================================================

class participantInfo {
    constructor(name, point) {
        this.name = name;
        this.point = point;
    }
}

try {
    // サーバー用にエクスポート（今後複数公開するかもしれないので module.exports ではなく exports にしておく）
    // クライアントは HTML から読み込む
    exports.participantInfo = participantInfo;
} catch (e) {
}
