// ============================================================================
// 
// クライアント・サーバー共通の定数
// 
// ============================================================================

// ----------------------------------------------------------------------------
// 言語仕様上は変数なので書き換えができてしまうことに注意
// ----------------------------------------------------------------------------

// ====================================================================
// ソケット通信イベント名
// ====================================================================

class socketEvents {
    // 新規グループ作成
    newGroup = "newGroup";

    // 既存グループに参加
    joinGroup = "joinGroup";

    // グループ UUID
    groupUuid = "groupUuid";

    // 参加人数
    numParticipants = "numParticipants";

    // プレイ開始
    startPlay = "startPlay";

    // エラー発生
    errorMessage = "errorMessage";
}

// ====================================================================
// URL パラメーター
// ====================================================================

class urlParams {
    // グループ UUID
    group = "group";
}

// ====================================================================
// 全体
// ====================================================================

class csConstants {
    // ソケット通信イベント名
    static socketEvents = new socketEvents();

    // URL パラメーター
    static params = new urlParams();
}

try {
    // サーバー用にエクスポート（1 つの時は module.exports が便利）
    // クライアントは HTML から読み込む
    module.exports = csConstants;
} catch (e) {
}
