// ============================================================================
//
// ラウンジコンポーネント（基底）
//
// ============================================================================

// ====================================================================
// View
// ====================================================================

<template>
</template>

<script>
export default {
    // ====================================================================
    // リアクティブ
    // ====================================================================

    data() {
        return {
            // グループ UUID
            groupUuid: null,

            // 参加人数
            numParticipants: 1,

            // エラーメッセージ
            errorMessage: null,

            // ソケット通信用
            socket: null,
        };
    },

    // ====================================================================
    // 関数
    // ====================================================================

    methods: {
        // ソケットイベントハンドラー（ホストとゲストの共通部分）を設定
        setSocketOn() {
            // 人数通知が来た
            this.socket.on(csConstants.socketEvents.numParticipants, (numParticipants) => {
                this.numParticipants = numParticipants;
            });

            // エラー通知が来た
            this.socket.on(csConstants.socketEvents.errorMessage, (errorMessage) => {
                this.errorMessage = errorMessage;
            });
        },
    },
}
</script>

<style></style>
