// ============================================================================
//
// 参加者情報（一人分）表示コンポーネント
//
// ============================================================================

<template>
    <span id="root">
        <span>{{ participantInfo.name }}</span>
        <span>：</span>
        <span>{{ participantInfo.point }} 点</span>
    </span>
</template>

<style>
span#root {
    margin: 0 2em 0 0;
}
</style>

<script>
export default {
    // ====================================================================
    // 構築時受領
    // ====================================================================

    props: ['participantInfo'],
}
</script>
