// ============================================================================
//
// 参加者情報（一人分）表示コンポーネント
//
// ============================================================================

<template>
    <span>
        <span>{{ participantInfo.name }}</span>
        <span>：</span>
        <span>{{ participantInfo.point }} 点</span>
    </span>
</template>

<style></style>

<script>
export default {
    // ====================================================================
    // 構築時受領
    // ====================================================================

    props: ['participantInfo'],
}
</script>
